# Intrudução ao Pandas

##### Por: Caio Euzébio

In [36]:
# Importando Pandas e Numpy

In [2]:
import pandas as pd
import numpy as np

In [8]:
# criando um DataFrame com intervalo de numeros aleatorios utilizando o numpy + pandas.

df = pd.DataFrame(np.random.randn(5,5), index='0 1 2 3 4'.split(), columns=' A B C D E'.split())

In [9]:
df

          A         B         C         D         E
0 -0.747569  1.466959 -0.771553 -0.177242  0.265721
1 -0.435350 -0.761461  0.806626  1.776997  0.177392
2  0.955084 -0.100296  1.328632 -1.102829 -1.395166
3 -0.124434  1.494115  1.201365 -1.884539 -0.215917
4  1.032190  0.817873 -1.095693 -1.437759 -0.165222

In [10]:
# Selecionando uma coluna

df['A']

0   -0.747569
1   -0.435350
2    0.955084
3   -0.124434
4    1.032190
Name: A, dtype: float64

In [11]:
# Selecionando multiplas Colunas

df[['A', 'B', 'C']]

          A         B         C
0 -0.747569  1.466959 -0.771553
1 -0.435350 -0.761461  0.806626
2  0.955084 -0.100296  1.328632
3 -0.124434  1.494115  1.201365
4  1.032190  0.817873 -1.095693

In [12]:
# Criando uma nova coluna

df['Nova Coluna'] = ''

In [13]:
df

          A         B         C         D         E Nova Coluna
0 -0.747569  1.466959 -0.771553 -0.177242  0.265721
1 -0.435350 -0.761461  0.806626  1.776997  0.177392
2  0.955084 -0.100296  1.328632 -1.102829 -1.395166
3 -0.124434  1.494115  1.201365 -1.884539 -0.215917
4  1.032190  0.817873 -1.095693 -1.437759 -0.165222

In [16]:
# Criando uma nova coluna partindo de uma operação

df['Nova Coluna Soma A e B'] = df['A'] + df['B']

In [17]:
df

,A,B,C,D,E,Nova Coluna,Nova Coluna Soma A e B
0,-0.747569,1.466959,-0.771553,-0.177242,0.265721,,0.719389
1,-0.435350,-0.761461,0.806626,1.776997,0.177392,,-1.196811
2,0.955084,-0.100296,1.328632,-1.102829,-1.395166,,0.854788
3,-0.124434,1.494115,1.201365,-1.884539,-0.215917,,1.369681
4,1.032190,0.817873,-1.095693,-1.437759,-0.165222,,1.850063

In [21]:
# Deletando uma coluna

df = df.drop('Nova Coluna Soma A e B', axis=1)

In [22]:
df

          A         B         C         D         E Nova Coluna
0 -0.747569  1.466959 -0.771553 -0.177242  0.265721
1 -0.435350 -0.761461  0.806626  1.776997  0.177392
2  0.955084 -0.100296  1.328632 -1.102829 -1.395166
3 -0.124434  1.494115  1.201365 -1.884539 -0.215917
4  1.032190  0.817873 -1.095693 -1.437759 -0.165222

In [23]:
# Deletando uma coluna direto no data frame

df.drop('Nova Coluna', axis=1, inplace=True)

In [24]:
df

          A         B         C         D         E
0 -0.747569  1.466959 -0.771553 -0.177242  0.265721
1 -0.435350 -0.761461  0.806626  1.776997  0.177392
2  0.955084 -0.100296  1.328632 -1.102829 -1.395166
3 -0.124434  1.494115  1.201365 -1.884539 -0.215917
4  1.032190  0.817873 -1.095693 -1.437759 -0.165222

In [26]:
# Localizando elementos basendo-se nos indices

df.loc['3', 'A']

-0.12443423606716034

In [28]:
# Fatimento de DataFrame

df.loc[['0', '1', '2'],['D', 'E']]

          D         E
0 -0.177242  0.265721
1  1.776997  0.177392
2 -1.102829 -1.395166

In [35]:
# Tambem é possivel fazer uma seleção/fatiamento utilizando o metodo iloc baseado em indices

df.iloc[1:4, 0:3]

          A         B         C
1 -0.435350 -0.761461  0.806626
2  0.955084 -0.100296  1.328632
3 -0.124434  1.494115  1.201365